Tekla Open API Reference for Tekla Structures 2025
WpfSteelFinishComboBox Class
 The WpfSteelFinishComboBox class represents a control to select the steel finish from the list.
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ItemsControl
 System.Windows.Controls.Primitives.Selector
 System.Windows.Controls.ComboBox
 Tekla.Structures.Dialog.UIControls.WpfSteelFinishComboBox
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfSteelFinishComboBox : ComboBox
Public Class WpfSteelFinishComboBox
	Inherits ComboBox
The WpfSteelFinishComboBox type exposes the following members.
Constructors
Name | Description
WpfSteelFinishComboBox
 Initiates a new instance of the control.
Top
Properties
Name | Description
Finish
 Gets or sets the finish value
Top
Fields
Name | Description
FinishProperty
 A dependency property that represents the finish value.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace